Финансы/src/Documents/ПеремещениеДенежныхСредств/ПеремещениеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеДенежныхСредств</name>
  <registerRecords>AccumulationRegister.ОстаткиДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <attributes>
    <name>ДатаЗачисления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаСписания</name>
    <type>
      <types>CatalogRef.СчетаУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗачисления</name>
    <type>
      <types>CatalogRef.СчетаУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаСписания</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаЗачисления</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСписания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗачисления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяПеремещения</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПеремещенияДенежныхСредств</name>
    <type>
      <types>CatalogRef.МестаРасходовДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

Финансы/src/AccumulationRegisters/ОстаткиДенежныхСредств/ОстаткиДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиДенежныхСредств</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>CatalogRef.СчетаУчета</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Финансы/src/AccumulationRegisters/ДвиженияДенежныхСредств/ДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияДенежныхСредств</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаПрихода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>CatalogRef.СчетаУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВалютаДвижения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДоходовРасходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоРасходовДенежныхСредств</name>
    <type>
      <types>CatalogRef.МестаРасходовДенежныхСредств</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Финансы/src/Documents/ПеремещениеДенежныхСредств/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ДатаЗачисления = Дата;
	
	СчетУчетаСписания = Константы.ОсновнойСчетУчета.Получить();
	Если ЗначениеЗаполнено(СчетУчетаСписания) Тогда
		ВалютаСписания = СчетУчетаСписания.ВалютаСчета;
	КонецЕсли;
	
	СчетУчетаЗачисления = Константы.ОсновнойСчетУчета.Получить();
	Если ЗначениеЗаполнено(СчетУчетаЗачисления) Тогда
		ВалютаЗачисления = СчетУчетаЗачисления.ВалютаСчета;
	КонецЕсли;
	
	СтатьяПеремещения = Константы.ОсновнойСчетУчета.Получить();
	МестоПеремещенияДенежныхСредств = Константы.ОсновноеМестоРасходаДенежныхСредств.Получить();
	
КонецПроцедуры

Процедура ЗаполнитьТаблицыДвижений(ТаблицаДляОстатков, ТаблицаДвиженийДенежныхСредств)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ПеремещениеДенежныхСредств.Дата КАК Период,
		|	ПеремещениеДенежныхСредств.СчетУчетаСписания КАК СчетУчета,
		|	ПеремещениеДенежныхСредств.СуммаСписания КАК Сумма
		|ИЗ
		|	Документ.ПеремещениеДенежныхСредств КАК ПеремещениеДенежныхСредств
		|ГДЕ
		|	ПеремещениеДенежныхСредств.Ссылка = &Ссылка
		|	И ПеремещениеДенежныхСредств.Дата <> ДАТАВРЕМЯ(1, 1, 1)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	ПеремещениеДенежныхСредств.ДатаЗачисления,
		|	ПеремещениеДенежныхСредств.СчетУчетаЗачисления,
		|	ПеремещениеДенежныхСредств.СуммаЗачисления
		|ИЗ
		|	Документ.ПеремещениеДенежныхСредств КАК ПеремещениеДенежныхСредств
		|ГДЕ
		|	ПеремещениеДенежныхСредств.Ссылка = &Ссылка
		|	И ПеремещениеДенежныхСредств.ДатаЗачисления <> ДАТАВРЕМЯ(1, 1, 1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеДанные.Период,
		|	ВсеДанные.ВалютаДвижения,
		|	ВсеДанные.СчетУчета,
		|	ВсеДанные.СтатьяДоходовРасходов,
		|	ВсеДанные.МестоРасходовДенежныхСредств,
		|	СУММА(ВсеДанные.СуммаПрихода) КАК СуммаПрихода,
		|	СУММА(ВсеДанные.СуммаРасхода) КАК СуммаРасхода
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПеремещениеДенежныхСредств.Дата КАК Период,
		|		ПеремещениеДенежныхСредств.ВалютаСписания КАК ВалютаДвижения,
		|		ПеремещениеДенежныхСредств.СчетУчетаСписания КАК СчетУчета,
		|		ПеремещениеДенежныхСредств.СтатьяПеремещения КАК СтатьяДоходовРасходов,
		|		0 КАК СуммаПрихода,
		|		ПеремещениеДенежныхСредств.СуммаСписания КАК СуммаРасхода,
		|		ЗНАЧЕНИЕ(Справочник.МестаРасходовДенежныхСредств.ПустаяСсылка) КАК МестоРасходовДенежныхСредств
		|	ИЗ
		|		Документ.ПеремещениеДенежныхСредств КАК ПеремещениеДенежныхСредств
		|	ГДЕ
		|		ПеремещениеДенежныхСредств.Ссылка = &Ссылка
		|		И ПеремещениеДенежныхСредств.Дата <> ДАТАВРЕМЯ(1, 1, 1)
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		ПеремещениеДенежныхСредств.ДатаЗачисления,
		|		ПеремещениеДенежныхСредств.ВалютаЗачисления КАК ВалютаДвижения,
		|		ПеремещениеДенежныхСредств.СчетУчетаЗачисления,
		|		ПеремещениеДенежныхСредств.СтатьяПеремещения,
		|		ПеремещениеДенежныхСредств.СуммаЗачисления,
		|		0,
		|		ПеремещениеДенежныхСредств.МестоПеремещенияДенежныхСредств
		|	ИЗ
		|		Документ.ПеремещениеДенежныхСредств КАК ПеремещениеДенежныхСредств
		|	ГДЕ
		|		ПеремещениеДенежныхСредств.Ссылка = &Ссылка
		|		И ПеремещениеДенежныхСредств.ДатаЗачисления <> ДАТАВРЕМЯ(1, 1, 1)) КАК ВсеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	ВсеДанные.Период,
		|	ВсеДанные.ВалютаДвижения,
		|	ВсеДанные.СчетУчета,
		|	ВсеДанные.СтатьяДоходовРасходов,
		|	ВсеДанные.МестоРасходовДенежныхСредств";

	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	МассивРезультатов = Запрос.ВыполнитьПакет();

	ТаблицаДляОстатков				= МассивРезультатов[0].Выгрузить();
	ТаблицаДвиженийДенежныхСредств	= МассивРезультатов[1].Выгрузить();

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
Перем ТаблицаДляОстатков, ТаблицаДвиженийДенежныхСредств;
	
	ЗаполнитьТаблицыДвижений(ТаблицаДляОстатков, ТаблицаДвиженийДенежныхСредств);
	
	Если ТаблицаДляОстатков.Количество() <> 0 Тогда
		
		Движения.ОстаткиДенежныхСредств.Записывать = Истина;
		Движения.ОстаткиДенежныхСредств.Загрузить(ТаблицаДляОстатков);
		
	КонецЕсли;
	
	Если ТаблицаДвиженийДенежныхСредств.Количество() <> 0 Тогда
		
		Движения.ДвиженияДенежныхСредств.Записывать = Истина;
		Движения.ДвиженияДенежныхСредств.Загрузить(ТаблицаДвиженийДенежныхСредств);
		
	КонецЕсли;
	
КонецПроцедуры
